cf/DataProcessors/QueryConsole.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>QueryConsole</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>UseAutosave</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AutoSavePeriod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PathToForms</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvailableDataTypes</Name>
					<Type>
						<v8:Type>v8:TypeDescription</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>The name of the XML file where queries and parameters are stored.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutputRefValuesInQueryResults</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TabOrderType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AlternatingColorsByQuery</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Queries</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Id</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Name</Name>
							<Comment>Query name</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Text</Name>
							<Comment>Query text</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RunTime</Name>
							<Comment>Execution time in seconds</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RowsCount</Name>
							<Comment>The number of rows returned as a result of the query</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ResultAddress</Name>
							<Comment>The address of the temporary storage where the result is stored</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QueryResultsAddress</Name>
							<Comment>Address of the array of query results in temporary storage</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QueryPlanStorageAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Parameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Id</Name>
							<Comment>Id</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QueryID</Name>
							<Comment>Request ID</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Name</Name>
							<Comment>Parameter name</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Comment>Type</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Comment>Parameter value</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/DataProcessors/QueryConsole/Forms/Boundary/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	DataProcessorObject 			= DataProcessorObject2();
	Object.AvailableDataTypes	= DataProcessorObject.Metadata().Attributes.AvailableDataTypes.Type;
	Object.PathToForms 			= DataProcessorObject.Metadata().FullName() + ".Form";
	
	Items.BoundaryType.ChoiceList.Add("Including");
	Items.BoundaryType.ChoiceList.Add("Excluding");
	FormBorderKind = Items.BoundaryType.ChoiceList.Get(0).Value;
	
	// Get a list of types and filter it.
	TypesList = DataProcessorObject2().GenerateListOfTypes();
	DataProcessorObject2().TypesListFiltering(TypesList, "Boundary");
	
	// Read transfer parameters.
	TransferParameters 	= GetFromTempStorage(Parameters.StorageAddress); // See DataProcessorObject.QueryConsole.PutQueriesInTempStorage
	Object.Queries.Load(TransferParameters.Queries);	
	Object.Parameters.Load(TransferParameters.Parameters);
	Object.FileName 	= TransferParameters.FileName;
	CurrentQueryID 	= TransferParameters.CurrentQueryID;
	CurrentParameterID	= TransferParameters.CurrentParameterID;
	
	FillValues();
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "GetPointInTime" Then 
		GetPointInTime(Parameter);
	EndIf;	
EndProcedure

///////////////////////////////////////////////////////////////////////////
// FORM ITEM EVENT HANDLERS

&AtClient
Procedure TypeStartChoice(Item, ChoiceData, StandardProcessing)
	
	StandardProcessing = False;
	NotifyDescription = New NotifyDescription("TypeSelectionCompletion", ThisObject);
	TypesList.ShowChooseItem(NotifyDescription, NStr("ru = 'Выбрать тип';
																|en = 'Choose type';"));
	
EndProcedure

&AtClient
Procedure TypeSelectionCompletion(SelectedElement, AdditionalParameters) Export
	
	If SelectedElement <> Undefined Then
		
		Current_Type = SelectedElement;
		TypeName    = Current_Type.Value;
		Type        = Current_Type.Presentation;
		
		If TypeName = "PointInTime" Then 
			
			Value       = Type;
			ValueInForm = Type;
			
		Else
			
			Array = New Array;
			Array.Add(Type(TypeName));
			LongDesc = New TypeDescription(Array);
			
			ValueInForm = LongDesc.AdjustValue(TypeName);
			Value       = LongDesc.AdjustValue(TypeName);
			
		EndIf;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure ValueInFormStartChoice(Item, ChoiceData, StandardProcessing)

	QueriesToPass = QueriesPassing();
	QueriesToPass.Insert("Value",Value);
	
	If TypeName = "PointInTime"  Then
		Path = Object.PathToForms + "." + "PointInTime";
		OpenForm(Path, QueriesToPass, ThisObject);
	EndIf;
	
EndProcedure

&AtClient
Procedure ValueInFormOnChange(Item)
	ChangeValueInForm();
EndProcedure

///////////////////////////////////////////////////////////////////////////
// COMMANDS

&AtClient
Procedure WriteBorder(Command)
	ExportBorderServer();
EndProcedure

///////////////////////////////////////////////////////////////////////////
// AUXILIARY PROCEDURES AND FUNCTIONS

&AtServer
Function DataProcessorObject2()
	Return FormAttributeToValue("Object");
EndFunction

// Pass tables "Queries" and "Parameters" as a structure.
//
&AtServer
Function QueriesPassing()
	StorageAddress		= DataProcessorObject2().PutQueriesInTempStorage(Object, CurrentQueryID,CurrentParameterID);
	AddressParameter		= New Structure;
	AddressParameter.Insert("StorageAddress", StorageAddress);
	Return AddressParameter;
EndFunction

&AtServer
Procedure GetPointInTime(StructureOfPassing)
	Value  		= StructureOfPassing.InternalTimeMoment;
	ValueInForm	= StructureOfPassing.PointInTimePresentation;
EndProcedure	

&AtClient
Procedure ExportBorderServer()
	
	TransferParameters = PutQueriesInStructure(CurrentQueryID, CurrentParameterID);
	Notify("GettingBorder", TransferParameters);
	Close(TransferParameters);
	 
	Owner 					= FormOwner;
	Owner.Modified = True;
	
EndProcedure	

&AtServer
Function BorderObjectInnerValue()
	TypeOfGran	= DataProcessorObject2().BorderKindDefinition(FormBorderKind);
	FormBorder 	= New Boundary(ValueFromStringInternal(Value),TypeOfGran);
	
	Return ValueToStringInternal(FormBorder);
EndFunction

&AtServer
Function PutQueriesInStructure(QueryID, ParameterId)
	FormParameters 	= Object.Parameters;
	
	BorderPresentation = GenerateBorder();
	
	For Each Page1 In FormParameters Do
		If Page1.Id = CurrentParameterID Then
			Page1.Type		 		= "Boundary";
			Page1.Value 		= BorderObjectInnerValue();
			Page1.TypeInForm		= NStr("ru = 'Граница';
										|en = 'Border';");
			Page1.ValueInForm	= BorderPresentation;
		EndIf;
	EndDo;
	
	TransferParameters = New Structure;
	TransferParameters.Insert("StorageAddress", DataProcessorObject2().PutQueriesInTempStorage(Object,QueryID,ParameterId));
	Return TransferParameters;
EndFunction	

&AtServer
Procedure FillValues()
	FormParameters = Object.Parameters;
	For Each CurrentParameter In FormParameters Do
		If CurrentParameter.Id = CurrentParameterID Then
			Value = CurrentParameter.Value;
			If IsBlankString(Value) Then
				Return;
			Else
				Break;
			EndIf;
		EndIf;
	EndDo;
	
	Boundary = ValueFromStringInternal(Value);
	If TypeOf(Boundary) <> Type("Boundary") Then
		Return;
	EndIf;
	
	ImportedValue = Boundary.Value;
	TypeName = DataProcessorObject2().TypeNameFromValue(ImportedValue);
	Type = TypesList.FindByValue(TypeName).Presentation;
	If StrCompare(TypeName, "PointInTime") <> 0 Then
		ValueInForm = ImportedValue;
	Else
		ValueInForm = DataProcessorObject2().GenerateValuePresentation(ImportedValue);
	EndIf;
	Value = ValueToStringInternal(ImportedValue);
	
	If Boundary.BoundaryType = BoundaryType.Including Then
		FormBorderKind = Items.BoundaryType.ChoiceList.Get(0).Value;
	Else
		FormBorderKind = Items.BoundaryType.ChoiceList.Get(1).Value;
	EndIf;
EndProcedure

&AtServer
Function GenerateBorder()
	TypeOfGran	= DataProcessorObject2().BorderKindDefinition(FormBorderKind);
	FormBorder 	= New Boundary(ValueFromStringInternal(Value),TypeOfGran);
	
	Presentation = DataProcessorObject2().GenerateValuePresentation(FormBorder);
	
	Return Presentation;
EndFunction	

&AtServer
Procedure ChangeValueInForm()
	Value = ValueToStringInternal(ValueInForm);
EndProcedure	

#EndRegion
